HELYXcore-4.4.0/examples/legacy/compressible/rhoPimpleFoam/RAS/angledDuctLTS/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porosity1
{
    type            explicitPorositySource;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        porosity;
        type            DarcyForchheimer;
        d   (5e7 -1000 -1000);
        f   (0 0 0);
        referenceFrame  porousFrame;
    }
}


// ************************************************************************* //
